<!-- dflook/terraform-github-actions {"workspace":"repository_dispatch-test-2","backend_type":"remote","backend":"0ed92fac296636a117d52b1ca63fafb347ed3d562a158a867d0dbec8b3b22db2","plan_job_ref":"Job Test Terraform cloud #164 at https://github.com/dflook/terraform-github-actions/actions/runs/5391053560","plan_hash":"337db21cad428b618aea8c7a15cbcb725fc64cae4908d1a609235d2bc7f82f53","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __repository_dispatch-test-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #164](https://github.com/dflook/terraform-github-actions/actions/runs/5391053560)